export const TOPICS = {
  1: {
    easy: [
      "Миний гэр, Намар, Өглөө, Хичээл, Нохой, Өвөл, , Найз, Шувуу, Ном, Хавар, Дүү, Зун, Хичээлээ хийх, Тоглоомын талбай, Шинэ жил,",
    ],
    medium: ["Үдийн цай, "],
    hard: ["Зургийн хичээл, Ээжийн туслах, Эх орон, Цэцэрлэг, "],
  },
  2: {
    easy: [
      "Миний гэр, Намар, Өглөө, Цэцэрлэг, Хичээл, Нохой, Өвөл, Эх орон, Үдийн цай, Найз, Шувуу, Ээжийн туслах, Ном, Хавар, Дүү, Зун, Хичээлээ хийх, Тоглоомын талбай, Зургийн хичээл, Шинэ жил,",
    ],
    medium: [],
    hard: [],
  },
  3: {
    easy: [
      "Миний гэр, Намар, Өглөө, Цэцэрлэг, Хичээл, Нохой, Өвөл, Эх орон, Үдийн цай, Найз, Шувуу, Ээжийн туслах, Ном, Хавар, Дүү, Зун, Хичээлээ хийх, Тоглоомын талбай, Зургийн хичээл, Шинэ жил,",
    ],
    medium: [],
    hard: [],
  },
  4: {
    easy: [
      "Миний гэр, Намар, Өглөө, Цэцэрлэг, Хичээл, Нохой, Өвөл, Эх орон, Үдийн цай, Найз, Шувуу, Ээжийн туслах, Ном, Хавар, Дүү, Зун, Хичээлээ хийх, Тоглоомын талбай, Зургийн хичээл, Шинэ жил,",
    ],
    medium: [],
    hard: [],
  },
  5: {
    easy: [
      "Миний гэр, Намар, Өглөө, Цэцэрлэг, Хичээл, Нохой, Өвөл, Эх орон, Үдийн цай, Найз, Шувуу, Ээжийн туслах, Ном, Хавар, Дүү, Зун, Хичээлээ хийх, Тоглоомын талбай, Зургийн хичээл, Шинэ жил,",
    ],
    medium: [],
    hard: [],
  },
};
