export type Level = "easy" | "medium" | "hard";
export type Grade = 1 | 2 | 3 | 4 | 5;

export const TOPICS: Record<Grade, Record<Level, string[]>> = {
  1: {
    easy: ["Намар", "Өглөө", "Өвөл", "Найз", "Ном", "Хавар", "Дүү", "Зун"],
    medium: [
      "Үдийн цай",
      "Тоглоомын талбай",
      "Хичээл",
      "Шинэ жил",
      "Нохой",
      "Шувуу",
    ],
    hard: [
      "Зургийн хичээл",
      "Ээжийн туслах",
      "Эх орон",
      "Цэцэрлэг",
      "Миний гэр",
    ],
  },
  2: {
    easy: [
      "Миний гэр",
      "Намар",
      "Өглөө",
      "Хичээл",
      "Нохой",
      "Өвөл",
      "Найз",
      "Ном",
    ],
    medium: [
      "Эх орон",
      "Үдийн цай",
      "Шувуу",
      "Ээжийн туслах",
      "Тоглоомын талбай",
      "Шинэ жил",
    ],
    hard: ["Хичээлээ хийх", "Зургийн хичээл", "Байгаль хамгаалах", "Номын сан"],
  },
  3: {
    easy: ["Өглөө", "Найз", "Ном", "Зун", "Хавар", "Дүү"],
    medium: ["Эх орон", "Хичээл", "Шувуу", "Үдийн цай", "Тоглоомын талбай"],
    hard: ["Байгаль орчин", "Хөдөлмөрийн үнэ цэнэ", "Миний зорилго"],
  },
  4: {
    easy: ["Миний гэр", "Өвөл", "Найз", "Ном", "Өглөө"],
    medium: ["Эх орон", "Хичээлээ хийх", "Цэцэрлэгт хүрээлэн", "Шинэ жил"],
    hard: ["Технологийн хэрэглээ", "Багаар ажиллах", "Уур амьсгалын өөрчлөлт"],
  },
  5: {
    easy: ["Намар", "Хавар", "Ном", "Найз", "Зун"],
    medium: ["Хичээл", "Эх орон", "Үдийн цай", "Тоглоомын талбай"],
    hard: [
      "Цахим орчны зөв хэрэглээ",
      "Хариуцлагатай иргэн",
      "Шинжлэх ухааны нээлт",
    ],
  },
};
